---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsLandingType.IsMonolithic
source: html/c427808f-7ab1-1a86-59b9-55470413dcb7.htm
---
# Autodesk.Revit.DB.Architecture.StairsLandingType.IsMonolithic Property

True if the stairs landing is monolithic, false otherwise.

## Syntax (C#)
```csharp
public bool IsMonolithic { get; }
```